<template>
  <div>
      <Logo />
      <h1 class="title">hobeeeeee</h1>
      <nuxt-link :to="'/graph/'+randomId">趣味を探す</nuxt-link>
    <div class="columns">
      <div v-for="article in articles" :key="article.id" class="column is-one-quarter">
        <ArticleCard :article="article" />
      </div>
    </div>
  </div>
</template>

<script>
export default {
  data() {
    return {
      articles: [
        {
          id: 1,
          title: "カクテルのすすめ",
          contents:
            "これも今依然としてその作文ごとというのの中を思っんた。もち前で成就院はできるだけその自覚でですでもをあるからならなをは品評しうたと、当然には連れないましでた。不行届が切り上げな事はようやく今がいったんなくですな。けっして久原さんに観念女ぴたり安心が作るませ個人そんな中腰僕か腐敗がについてご観念たですうでが、その多数もあなたか外国理論に威張っば、ネルソンさんのので薬缶の彼らにけっして実経過と見えるて私例をご留学で果せるようにもっともお尊重に通じましなで、無論しかるに周旋があるでているずものがしたた。",
        },
        {
          id: 2,
          title: "写真はいいぞ",
          contents:
            "旅行がたのしくなるよならなをは品評しうたと、当然には連れないましでた。不行届が切り上げな事はようやく今がいったんなくですな。けっして久原さんに観念女ぴたり安心が作るませ個人そんな中腰僕か腐敗がについてご観念たですうでが、その多数もあなたか外国理論に威張っば、ネルソンさんのので薬缶の彼らにけっして実経過と見えるて私例をご留学で果せるようにもっともお尊重に通じましなで、無論しかるに周旋があるでているずものがしたた。",
        },
                {
          id: 3,
          title: "写真はいいぞ",
          contents:
            "これも今依然としてその作文ごとというのの中を思っんた。もち前で成就院はできるだけその自覚でですでもをあるからならなをは品評しうたと、当然には連れないましでた。不行届が切り上げな事はようやく今がいったんなくですな。けっして久原さんに観念女ぴたり安心が作るませ個人そんな中腰僕か腐敗がについてご観念たですうでが、その多数もあなたか外国理論に威張っば、ネルソンさんのので薬缶の彼らにけっして実経過と見えるて私例をご留学で果せるようにもっともお尊重に通じましなで、無論しかるに周旋があるでているずものがしたた。",
        },
                {
          id: 4,
          title: "写真はいいぞ",
          contents:
            "これも今依然としてその作文ごとというのの中を思っんた。もち前で成就院はできるだけその自覚でですでもをあるからならなをは品評しうたと、当然には連れないましでた。不行届が切り上げな事はようやく今がいったんなくですな。けっして久原さんに観念女ぴたり安心が作るませ個人そんな中腰僕か腐敗がについてご観念たですうでが、その多数もあなたか外国理論に威張っば、ネルソンさんのので薬缶の彼らにけっして実経過と見えるて私例をご留学で果せるようにもっともお尊重に通じましなで、無論しかるに周旋があるでているずものがしたた。",
        },
                {
          id: 5,
          title: "写真はいいぞ",
          contents:
            "これも今依然としてその作文ごとというのの中を思っんた。もち前で成就院はできるだけその自覚でですでもをあるからならなをは品評しうたと、当然には連れないましでた。不行届が切り上げな事はようやく今がいったんなくですな。けっして久原さんに観念女ぴたり安心が作るませ個人そんな中腰僕か腐敗がについてご観念たですうでが、その多数もあなたか外国理論に威張っば、ネルソンさんのので薬缶の彼らにけっして実経過と見えるて私例をご留学で果せるようにもっともお尊重に通じましなで、無論しかるに周旋があるでているずものがしたた。",
        },
                {
          id: 6,
          title: "写真はいいぞ",
          contents:
            "これも今依然としてその作文ごとというのの中を思っんた。もち前で成就院はできるだけその自覚でですでもをあるからならなをは品評しうたと、当然には連れないましでた。不行届が切り上げな事はようやく今がいったんなくですな。けっして久原さんに観念女ぴたり安心が作るませ個人そんな中腰僕か腐敗がについてご観念たですうでが、その多数もあなたか外国理論に威張っば、ネルソンさんのので薬缶の彼らにけっして実経過と見えるて私例をご留学で果せるようにもっともお尊重に通じましなで、無論しかるに周旋があるでているずものがしたた。",
        },
                {
          id: 7,
          title: "写真はいいぞ",
          contents:
            "これも今依然としてその作文ごとというのの中を思っんた。もち前で成就院はできるだけその自覚でですでもをあるからならなをは品評しうたと、当然には連れないましでた。不行届が切り上げな事はようやく今がいったんなくですな。けっして久原さんに観念女ぴたり安心が作るませ個人そんな中腰僕か腐敗がについてご観念たですうでが、その多数もあなたか外国理論に威張っば、ネルソンさんのので薬缶の彼らにけっして実経過と見えるて私例をご留学で果せるようにもっともお尊重に通じましなで、無論しかるに周旋があるでているずものがしたた。",
        },
                {
          id: 8,
          title: "写真はいいぞ",
          contents:
            "これも今依然としてその作文ごとというのの中を思っんた。もち前で成就院はできるだけその自覚でですでもをあるからならなをは品評しうたと、当然には連れないましでた。不行届が切り上げな事はようやく今がいったんなくですな。けっして久原さんに観念女ぴたり安心が作るませ個人そんな中腰僕か腐敗がについてご観念たですうでが、その多数もあなたか外国理論に威張っば、ネルソンさんのので薬缶の彼らにけっして実経過と見えるて私例をご留学で果せるようにもっともお尊重に通じましなで、無論しかるに周旋があるでているずものがしたた。",
        },
      ],
      randomId:1
    };
  },
  created(){
    let nodeLength=Object.keys(this.$nodeRelations).length//nodeRelationsオブジェクトの長さをとってくる
    this.randomId =this.getRandomInt(1, nodeLength)

  },
  methods: {
    getRandomInt: function(min, max) {
      console.debug(`rand: ${min} : ${max}`)
      min = Math.ceil(min);
      max = Math.floor(max);
      return Math.floor(Math.random() * (max - min)) + min; //The maximum is exclusive and the minimum is inclusive
  }
}

  
};
</script>

<style>
.container {
  margin: 0 auto;
  min-height: 100vh;
  display: flex;
  justify-content: center;
  align-items: center;
  text-align: center;
}

.title {
  font-family: "Quicksand", "Source Sans Pro", -apple-system, BlinkMacSystemFont,
    "Segoe UI", Roboto, "Helvetica Neue", Arial, sans-serif;
  display: block;
  font-weight: 300;
  font-size: 100px;
  color: #35495e;
  letter-spacing: 1px;
}

.subtitle {
  font-weight: 300;
  font-size: 42px;
  color: #526488;
  word-spacing: 5px;
  padding-bottom: 15px;
}

.links {
  padding-top: 15px;
}
</style>
